import React from "react";
import SvgIcon from "@mui/material/SvgIcon";

import { IActionIconProps } from "./ActionIconProps";
// 新增的icon
function Icon({ isActive = false, fontSize = 58 }: IActionIconProps) {
  return (
    <SvgIcon sx={{ fontSize }}>
      <svg
        xmlns="http://www.w3.org/2000/svg"
        xmlnsXlink="http://www.w3.org/1999/xlink"
        fill="none"
        version="1.1"
        width="84"
        height="84"
        viewBox="0 0 84 84"
      >
        <defs>
          <linearGradient
            x1="0.5"
            y1="0"
            x2="0.5"
            y2="1"
            id="master_svg0_276_00399"
          >
            <stop offset="0%" stopColor="#00E7E7" stopOpacity="1" />
            <stop offset="100%" stopColor="#008787" stopOpacity="1" />
          </linearGradient>
        </defs>
        <g>
          <g>
            <rect
              x="0"
              y="0"
              width="84"
              height="84.00000762939453"
              rx="15"
              fill="url(#master_svg0_276_00399)"
              fillOpacity="1"
            />
          </g>
          <g opacity="0.800000011920929">
            <path
              d="M65.6585,36.0785L63.8293,34.470600000000005C59.3171,30.636400000000002,53.2195,25.31787,45.5366,18.638840000000002L44.8049,18.02041C43.2195,16.659864,40.7805,16.659864,39.1951,18.02041L30.5366,25.56524C25.658540000000002,29.7706,21.634149999999998,33.2338,18.46341,35.954899999999995C17.487805,36.697,17,37.8101,17,39.047L17,39.294399999999996C17.121951,41.520700000000005,18.95122,43.1286,21.02439,43.1286L23.70732,43.1286L23.70732,63.9079C23.70732,65.6395,25.04878,67,26.7561,67L36.1463,67C37.731700000000004,66.8763,38.9512,65.5158,38.9512,63.9079L38.9512,53.1472C38.9512,52.4051,39.439,51.9103,40.1707,51.9103L43.8293,51.9103C44.561,51.9103,45.0488,52.4051,45.0488,53.1472L45.0488,63.9079C45.0488,65.6395,46.3902,67,48.0976,67L57.4878,67C59.0732,66.8763,60.2927,65.5158,60.2927,63.9079L60.2927,43.1286L62.9756,43.1286C65.1707,43.1286,67,41.2733,67,39.047C67,37.8101,66.5122,36.8207,65.6585,36.0785Z"
              fill="#FFFFFF"
              fillOpacity="1"
            />
          </g>
        </g>
      </svg>
    </SvgIcon>
  );
}

export default Icon;
